{"sections":{"main":{"type":"page","disabled":true,"settings":{"kicker":"Our Team","kicker_size":3,"show_title":false,"title_size":8,"show_content":true,"content_size":5,"align_text":"text-left","text_color":"text--neutral","bg":"palette--light bg--neutral","width":"wrapper","padding_top":36,"padding_bottom":36}},"section_richtext_4Wm6eT":{"type":"section-richtext","blocks":{"kicker_7HhMVK":{"type":"kicker","settings":{"kicker":"","enable_line":false,"text_size":4}},"heading_ADmgLV":{"type":"heading","settings":{"heading":"Meet the Team","text_size":8}},"text_PaQzBx":{"type":"text","settings":{"text":"<p>Visit our careers page or subscribe  to the ArtLifting newsletter to learn about job opportunities.<\/p><p>ArtLifting leadership is supported by the Artist Advisory Board. <a href=\"\/pages\/artist-advisory-board\" title=\"Artist Advisory Board (2023 - 2024)\">Meet our current cohort here.<\/a><\/p>","text_size":4,"text_columns":1}},"button_gVq8dM":{"type":"button","settings":{"link_text_1":"Contact Us","link_1":"shopify:\/\/pages\/contact-us","button_size_1":"btn--large","button_style_1":"btn","button_color_1":"btn--secondary","link_text_2":"Subscribe","link_2":"http:\/\/eepurl.com\/g8n9ij","button_size_2":"btn--large","button_style_2":"btn","button_color_2":"btn--neutral","link_text_3":"Careers","link_3":"shopify:\/\/pages\/careers","button_size_3":"btn--large","button_style_3":"btn","button_color_3":"btn--neutral"}}},"block_order":["kicker_7HhMVK","heading_ADmgLV","text_PaQzBx","button_gVq8dM"],"settings":{"align_text":"text-left","text_color":"text--neutral","bg":"palette--light bg--neutral","content_width":2000,"width":"wrapper","padding_top":36,"padding_bottom":36}},"section_bios_irCpHr":{"type":"section-bios","blocks":{"select_fAhrVt":{"type":"select","settings":{"bios_name":"Liz Powers","bios_pronouns":"she \/ her","bios_title":"Co-Founder & CEO","bios_location":"Boston, MA","bios_company":"","bios_company_link":"","bios_details":"<p>Liz Powers (she\/her) is driven by ArtLifting’s incredible artists. Her dream is to share their work with the world while also making the economy more inclusive. <\/p><p>The inspiration for ArtLifting came from Liz’s experiences as a volunteer social worker from 2007-2010 and founding art groups in shelters for unhoused people from 2010-2012. Liz founded ArtLifting in November of 2013 along with her brother Spencer Powers. <\/p><p>Liz was selected for Forbes “30 Under 30” and Boston Globe’s “Game Changers.” During her free time Liz loves to make art out of old books, hike, practice yoga, run, and sail. <\/p>","bios_artwork":"vibrant-power","bios_quote":"<p>\"I love the calm color palette balanced with the energetic motion in this piece. It was created by the incredible artist Andrew Weatherly. Andrew makes me smile! He is warm, talented, and has amazing dance moves.\"<\/p>","bios_image":"shopify:\/\/shop_images\/LizPowers_website_headshot.jpg","bios_email":"liz@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/liz-powers-8a575432"}},"select_gfxzDR":{"type":"select","settings":{"bios_name":"Christina Bailey","bios_pronouns":"","bios_title":"Chief Growth Officer","bios_location":"Charlotte, NC","bios_company":"","bios_company_link":"","bios_details":"<p>Christina Bailey (she\/her) is a strategic growth professional with leadership experience in early-stage startups, non-profit management and corporate partnerships. She believes in conscious capitalism and is motivated to advance disability inclusion. <\/p><p>Through her work at ArtLifting, she delivers positive business outcomes for customers while creating economic opportunity for the ArtLifting community. <\/p><p>Christina's experience with her disabled sister created perspective and taught her the importance of sharing the talents, values, and stories of marginalized communities. <\/p><p>Christina finds joy and energy through her work and being active outside, exploring the world through travel, enjoying good food, and spending time with her friends and family. Her partner Scott, son Jude, and daughters Bree and Maren, inspiring her to be curious, intentional, and fun.<\/p>","bios_artwork":"dancing-in-the-moonlight-johnson-simon","bios_quote":"<p><em>\"In addition to Dancing in the Moonlight being one of mine and my partner's favorite songs, I share a passion for dance with artist Johnson Simon. I admire Johnson’s ability to find movement through art and his perspective that 'life is what you make of it.\"<\/em><\/p>","bios_image":"shopify:\/\/shop_images\/ChristinaBailey_website_headshot.jpg","bios_email":"christina@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/christina-strubbe-bailey\/"}},"select_8iC8Aa":{"type":"select","settings":{"bios_name":"Mike Gary","bios_pronouns":"","bios_title":"Senior Director of Operations","bios_location":"Carol Stream, IL","bios_company":"","bios_company_link":"","bios_details":"<p>Mike Gary (he\/him) found his way into business operations in 2017 and has loved the challenge finding and creating process and business improvements. <\/p><p>He was inspired to join the ArtLifting Team by his uncle who was an artist that experienced a traumatic brain injury at a young age. <\/p><p>As his creative outlet, Mike enjoys creating pottery and loves the freedom of creating virtually anything out of clay. He is also a proud dog dad to Poppy and Lucy.<\/p>","bios_artwork":"balancing-act","bios_quote":"<p>\"<em>This image captures the simple and delicate beauty that can be found in nature. Michael's photography inspires me to notice the little beauties in life that I may have otherwise overlooked.<\/em>\"<\/p>","bios_image":"shopify:\/\/shop_images\/MikeGary_website_headshot.jpg","bios_email":"mike@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/michael-gary\/"}},"select_zknMDB":{"type":"select","settings":{"bios_name":"Mary Beth Sullivan","bios_pronouns":"","bios_title":"Senior Director of Sales","bios_location":"Cranford, NJ","bios_company":"","bios_company_link":"","bios_details":"<p>Mary Beth Sullivan (she\/her) draws on her deep experience and proven success in strategic sales leadership, applying it to guide and support the team of Art Advisors. <\/p><p>Mary Beth is focused on finding opportunities to amplify our mission, expand our reach, and increase access to a broader audience for ArtLifting artists. She is deeply passionate about the impact ArtLifting is making on the lives of so many artists whose visibility and potential had previously been limited.<br\/><br\/>Mary Beth’s heart is fueled by her large blended family and she draws energy from the time they spend together. She loves to be outdoors and feels most at peace whenever she is near the water. To Mary Beth, movement is medicine – she begins each day with a run or yoga, which helps her to stay grounded and positive.<br\/><\/p>","bios_artwork":"contemplative-garden-andrew-weatherly-print","bios_quote":"<p>\"I was drawn to this artwork from the moment I saw it. The soothing water reflecting soft, glowing colors felt instantly calming to me. Too often the world can be chaotic and noisy. I love Andrew Weatherly’s reminder that, if we look carefully, we can find peace and serenity wherever we go.\"<br\/><\/p>","bios_image":"shopify:\/\/shop_images\/MaryBethSullivan_TeamHeadshot.jpg","bios_email":"marybeth@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/mary-beth-sullivan-6ba9368\/"}},"select_XhxtPt":{"type":"select","disabled":true,"settings":{"bios_name":"Elliott Taylor","bios_pronouns":"","bios_title":"Creative Director","bios_location":"Aptos, CA","bios_company":"","bios_company_link":"","bios_details":"<p>Elliott Taylor (he\/him) is a creative professional with over 18 years of experience in the field. He is endlessly fascinated by the creative journey that each artist experiences. Elliott has a wide breath and depth of creative understanding in theory and in practice. He began his career as a photographer, which has given him a quick and keen eye for visual understanding. Since 2015, Elliott has worked with and for artists living with disabilities. One of his core beliefs is that art and creativity engenders understanding, social and cultural bonding, and community for all involved.<\/p>","bios_artwork":"bold-black-white","bios_quote":"","bios_image":"shopify:\/\/shop_images\/ElliottTaylor_website_headshot_23e78992-1990-46da-a323-a57821644e32.jpg","bios_email":"elliott@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/elliott-l-taylor\/"}},"select_9FbfJ9":{"type":"select","disabled":true,"settings":{"bios_name":"Jocelyn Tuttle","bios_pronouns":"","bios_title":"Head of People","bios_location":"Jamestown, RI","bios_company":"","bios_company_link":"","bios_details":"<p>Jocelyn Tuttle (she\/her) is a human resources leader with over 15 years of experience serving startups and mission-driven organizations. She is passionate about finding the sweet spot between business and people, and creating inclusive, supportive, transparent, and fun workplaces. Jocelyn’s free time is filled with baking and cooking for family, learning how to play tennis, snuggling with her dog, Shy, and enjoying the coastline of her home state of Rhode Island.<\/p>","bios_artwork":"summers-day","bios_quote":"<p>\"<em>This painting by Andrew Weatherly makes me want to step outside, close my eyes, hold my face up to the sky, and smile. The blues and purples are unexpected in the sun’s rays and I love the swirl of the shorter brush strokes.<\/em>\"<\/p>","bios_image":"shopify:\/\/shop_images\/JocelynTuttle_website_headshot.jpg","bios_email":"jocelyn@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/jocelyn-tuttle\/"}},"select_wBAPyD":{"type":"select","settings":{"bios_name":"Bree Lalor","bios_pronouns":"","bios_title":"Head Curator","bios_location":"New York City, NY","bios_company":"","bios_company_link":"","bios_details":"<p>Bree Lalor (she\/her) has been curating for ArtLifting for over five years, and now leads our team of curators, who work to create engaging artwork collections for each of our clients. Bree is passionate about the power of art to inspire social change, and the importance of diverse representation in the art world. In her free time, Bree enjoys singing with her<em>a cappella <\/em>group, biking around New York City, creating her own artwork, and spending time in Prospect Park with her dog, Pinto.<\/p>","bios_artwork":"warmth-of-new-york-city-10-quana-madison","bios_quote":"<p>\"<em>Quána Madison's piece Warmth Of New York City 1.0 captures the love I feel for the city. I love how Quána describes New York's energy as 'a warm feeling of electricity' – I definitely resonate with that!<\/em>\"<\/p>","bios_image":"shopify:\/\/shop_images\/BreeLalor_website_headshot.jpg","bios_email":"bree@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/breelalor\/"}},"select_mT3rqg":{"type":"select","settings":{"bios_name":"Sadie Shillieto","bios_pronouns":"","bios_title":"Senior Product & Operations Specialist","bios_location":"Lowell, MA","bios_company":"","bios_company_link":"","bios_details":"<p>Sadie Shillieto's (she\/her) career has been driven by the desire to make art accessible. Before joining ArtLifting she was in the museum field, focusing on collections care and management. While working with a museum's corporate lending program it became clear to her that the best way to get people to engage with art was by bringing it right into their office spaces. Sadie is excited to now be working for a community of talented artists who are not adequately represented in the rest of the art world, doubling her impact!<\/p>","bios_artwork":"underwater-garden","bios_quote":"<p>\"<em>Underwater Garden is so soothing because I can almost see the fronds moving with a gentle current, yet it is so other worldly and transportive. Zoom in and the composition changes completely as it is built up of small, multi-colored squares.<\/em>\"<\/p>","bios_image":"shopify:\/\/shop_images\/SadieShillieto_website_headshot.jpg","bios_email":"sadie@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/sadie-shillieto-428912190\/"}},"select_WqwA7d":{"type":"select","settings":{"bios_name":"Haley Wodarczyk","bios_pronouns":"","bios_title":"Artist Program Director","bios_location":"Boston, MA","bios_company":"","bios_company_link":"","bios_details":"<p>Haley Wodarczyk (she\/her) manages all ArtLifting artists, collaborates with Community Partner organizations, and searches for new artists who can grow and add to our community. She is a passionate advocate who aims to encourage, uplift, provide resources, and impact each individual. Haley’s experience as a Direct Care Counselor and Case Manager for individuals living with disabilities and experiencing houselessness has given her a breadth of knowledge and understanding which she applies to ArtLifting. She loves exploring nature, traveling abroad and creating art in various forms.<\/p>","bios_artwork":"working-through-what-i-wouldnt-do-madison-elyse-rubenstein","bios_quote":"<p>\"<em>This artwork makes me feel imaginative, energized and free! When I am brainstorming or working on a hard project, I imagine my mind looks like this – bursting with color and movement.<\/em>\"<\/p>","bios_image":"shopify:\/\/shop_images\/HaleyWodarczyk_website_headshot.jpg","bios_email":"haley@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/haley-wodarczyk-a64288bb\/"}},"select_xHm8Ad":{"type":"select","settings":{"bios_name":"Michael Korcek","bios_pronouns":"","bios_title":"Director of Marketing","bios_location":"San Francisco, CA","bios_company":"","bios_company_link":"","bios_details":"<p>Michael Korcek (he\/him) is a marketing professional with over 14 years of experience crafting customer experiences and forging innovative creative partnerships with brands like JanSport, Hines, LinkedIn, MillerKnoll, and Dropbox. <\/p><p>He is passionate about art world accessibility and supporting art centers for developmentally disabled artists. In his free time, Michael enjoys exploring Bay Area restaurants, hiking in Northern California, collecting local art, and hanging out with his twin tuxedo cats.<\/p>","bios_artwork":"uncanny-valley-justin-ellis","bios_quote":"<p>\"<em>I love the way this painting by Justin Ellis plays with the idea of a landscape by building layers of colors that evoke natural land formations.<\/em>\"<\/p>","bios_image":"shopify:\/\/shop_images\/MichaelKorcek_website_headshot.jpg","bios_email":"michael@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/michael-korcek\/"}},"select_R63Ngb":{"type":"select","settings":{"bios_name":"Leah Mosher","bios_pronouns":"","bios_title":"Business Development & Sales Operations Manager","bios_location":"Eatontown, NJ","bios_company":"","bios_company_link":"","bios_details":"<p>Leah Mosher's (she\/her) diverse background includes roles in sales, operations and client relationship management. Leah’s career has been centered around the goal of building connections through thoughtful and effective communication. She is deeply motivated by ArtLifting’s mission and the opportunity to apply her past experience to build connections that amplify creative voices in underrepresented communities. In her free time, Leah is an avid rock climber, hiker and concert-goer. On quieter days, she enjoys making art or reading a book, in the company of her two cats.<\/p>","bios_artwork":"artists-mri-lindsey-holcomb","bios_quote":"<p>\"<em>I love artwork that plays on the balance between order and chaos. Lindsey captures that beautifully in this piece through her use of free flowing bursts of color, layered and connected with delicate straight lines and intricate details.<\/em>\"<\/p>","bios_image":"shopify:\/\/shop_images\/LeahMosher_website_headshot.jpg","bios_email":"leah@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/leah-mosher-b34658223\/"}},"select_PJgYGn":{"type":"select","settings":{"bios_name":"Kylene George","bios_pronouns":"","bios_title":"Events & Marketing Manager","bios_location":"","bios_company":"","bios_company_link":"","bios_details":"<p>Kylene George (she\/her) brings over a decade of experience in marketing, events, and philanthropic engagement to her role at ArtLifting. Prior to ArtLifting, Kylene worked in the nonprofit, education, and corporate sectors. <\/p><p>Kylene is driven by the belief that powerful storytelling and inclusive engagement can drive real impact. She is inspired by ArtLifting’s mission and the opportunity to amplify the voices of artists with disabilities. <br\/><br\/>Outside of work, Kylene enjoys sampling local bites at farmer’s markets, exploring new cities, catching a Padres game, taking long walks with her dog, and spending time with her husband and daughter.<\/p>","bios_artwork":"happy-happy-birthday-1-charlie-french","bios_quote":"<p>\"I love the cheerful colors Charlie French has chosen; they evoke joy and celebration. It really does remind me of a delicious fun-fetti birthday cake!\"<\/p>","bios_image":"shopify:\/\/shop_images\/KyleneGeorge_TeamHeadshot.jpg","bios_email":"kylene@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/kylenegeorge\/"}},"select_XQPcwN":{"type":"select","settings":{"bios_name":"Alessandra Lourenco","bios_pronouns":"","bios_title":"Program Operations Manager","bios_location":"San Diego, CA","bios_company":"","bios_company_link":"","bios_details":"<p>As a member of the Operations Team, Alessandra Lourenco contributes across account management, artwork operations, and project execution. With a blend of strategic thinking and practical implementation, she ensures effective account management, comprehending each client's needs and curating bespoke solutions that align with their goals and aspirations. With over 6 years immersed in the vibrant Los Angeles art scene, Alessandra has contributed to various art organizations, including a contemporary art fair, an art logistics company, and multiple contemporary galleries. As a practicing artist herself, Alessandra grasps the profound impact and importance of art. Alessandra is passionate about empowering talented artists who are not adequately represented and helping to build meaningful, socially-impactful collections for businesses, aiming to foster inclusivity and diverse representation in contemporary art.<\/p>","bios_artwork":"pickup-sticks-4","bios_quote":"<p><em>\"The deliberate arrangement of minimalistic elements within the composition convey a sense of tranquility and inner reflection, seeming to draw inspiration from the harmonious hues and tones found in the natural world, where every shade and tint coexist in perfect balance.\"<\/em><\/p>","bios_image":"shopify:\/\/shop_images\/AlessandraRosser_website_headshot.jpg","bios_email":"alessandra@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/alessandra-lourenco-118b13134\/"}},"select_r3fqiC":{"type":"select","settings":{"bios_name":"Laura Prados-Bacó","bios_pronouns":"","bios_title":"Business Development & Marketing Coordinator","bios_location":"New York City, NY","bios_company":"","bios_company_link":"","bios_details":"<p>Laura Prados Bacó (she\/they) supports ArtLifting's inbound and outbound business development and marketing efforts, event strategies, and licensing partnerships. Before joining ArtLifting, Laura honed her marketing skills while interning at Facebook and served as a Business Development Associate at a Boston-based tech startup. She also worked at Babson College's Sorenson Visual Arts Center, where she managed the permanent art collection and facilitated gallery events. Merging her passions for entrepreneurship, social impact, and art, Laura embraces ArtLifting's mission to amplify talented artists often overlooked in the art market. Laura is a dancer, an avid reader, and loves crocheting!<\/p>","bios_artwork":"memories-of-puerto-rico","bios_quote":"<p>\"<em>Aneliya's mastery of colors in this painting is breathtaking. The painting evokes memories of my home, San Juan, and days spent on the beach with my loved ones. Puerto Rico's natural beauty is unmatched — Aneliya does a phenomenal job of capturing that.<\/em>\"<\/p>","bios_image":"shopify:\/\/shop_images\/LauraPradosBaco_website_headshot.jpg","bios_email":"laura@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/laurapradosbaco\/"}},"select_b79CbE":{"type":"select","settings":{"bios_name":"Brooke Broecker","bios_pronouns":"","bios_title":"Content & Marketing Coordinator","bios_location":"Denver, CO","bios_company":"","bios_company_link":"","bios_details":"<p>Brooke Broecker (she\/her) is a creative marketer who is passionate about crafting narratives that inspire action. At ArtLifting, she brings artists’ and clients’ stories to life, creating content that showcases their talent and impact while strengthening the company’s mission and digital presence. Brooke believes that inclusive engagement can spark meaningful change and is inspired by ArtLifting’s mission to amplify the voices of artists with disabilities.<\/p>","bios_artwork":"church-street-south-building-vito-bonanno-print","bios_quote":"<p>\"What first drew me to this artwork was its chaotic, multi-layered energy. Every detail feels alive, pulling you in the longer you look. To me, it reflects the many layers of the human experience and how each person carries countless stories, emotions, and moments that shape who they are.\"<\/p>","bios_image":"shopify:\/\/shop_images\/BrookeBroecker_website_headshot.jpg","bios_email":"brooke@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/brooke-broecker-144869173\/"}},"select_qwXaCp":{"type":"select","disabled":true,"settings":{"bios_name":"Alison Burke","bios_pronouns":"","bios_title":"Art Advisor","bios_location":"Orlando, FL","bios_company":"","bios_company_link":"","bios_details":"<p>Alison Burke (she\/her) is an art lover with over 15 years of experience in fundraising, business development, and client management in the arts and culture sector. Prior to ArtLifting, she helped artists tell their stories through engaging audio and digital media experiences. She is excited to continue that storytelling tradition with her ArtLifting clients and build relationships that make an impact. Outside of work, she loves theme parks, road trips, and making magic as a volunteer with a local children’s nonprofit. She’s also a dog lover and enjoys being bossed around by her spirited dachshund.<\/p>","bios_artwork":"the-storm-before-the-calm-alene-sirott-cope","bios_quote":"<p>\"<em>I was really drawn to the colors in this piece - there’s an element of fantasy, and I’m instantly reminded of some of the magical candy-colored skies I get to see living in Florida.<\/em>\"<\/p>","bios_image":"shopify:\/\/shop_images\/AlisonBurke_website_headshot_79f569ef-7044-4fb8-9d60-a1ad95ae80db.jpg","bios_email":"alison@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/alisonmburke\/"}},"select_VehT4G":{"type":"select","settings":{"bios_name":"Anne Bustamante","bios_pronouns":"","bios_title":"Art Advisor","bios_location":"Chicago, IL","bios_company":"","bios_company_link":"","bios_details":"<p>Anne Bustamante (she\/her) is a Chicago-based contemporary art advisor with more than two decades of combined experience working in the arts and with corporate clients. She works primarily with ArtLifting’s financial partners to make their values visible while creating new opportunities for artists to share their stories and talents more broadly. Anne is an advocate for the arts, an avid reader, and a senior animal super fan.<\/p>","bios_artwork":"mountain","bios_quote":"<p>\"<em>I’m drawn to Yasmine’s use of color and expression in her work. Her paintings are exciting, unexpected, and rich in color and subject matter.<\/em>\"<\/p>","bios_image":"shopify:\/\/shop_images\/AnneBustamante_website_headshot.jpg","bios_email":"anne.bustamante@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/anne-bustamante-a7bb784\/"}},"select_8j3bzN":{"type":"select","settings":{"bios_name":"Erin Cousins","bios_pronouns":"","bios_title":"Art Advisor","bios_location":"Ferndale, MI","bios_company":"","bios_company_link":"","bios_details":"<p>As an Art Advisor, Erin Cousins (she\/her) specializes in guiding real estate companies to elevate spaces through artwork. Prior to ArtLifting, she worked closely with artists and educators to create immersive installations, community programs, and interactive exhibitions in the museum sector. In all her work, Erin is driven by a desire to celebrate the work of talented creatives in our communities and help people achieve their goals.<\/p>","bios_artwork":"isle-of-the-sky-3","bios_quote":"<p>\"<em>This artwork always gives me a sense of calm and well-being – that's why I have it in my living room! I hope to travel to Scotland someday and see the colors that inspired Charlie.<\/em>\"<\/p>","bios_image":"shopify:\/\/shop_images\/ErinCousings_website_headshot.jpg","bios_email":"erin@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/erin-cousins\/"}},"select_zCM64w":{"type":"select","disabled":true,"settings":{"bios_name":"Sharon Heitzenroder","bios_pronouns":"","bios_title":"Art Advisor","bios_location":"Honolulu, HI","bios_company":"","bios_company_link":"","bios_details":"<p>Sharon Heitzenroder (she\/her) is a contemporary art advisor with over fifteen years of experience working in the arts, from teaching at the college level to being a practicing artist. As an art advisor, she brings a wealth of experience in creating equitable access for underrepresented communities and ensuring diversity is top of mind for creative collections and projects. In her free time, she can be found hiking and surfing with her dog, or creating art in her studio alongside her cat and dog.<\/p>","bios_artwork":"faceless-world-with-hope","bios_quote":"<p>\"<em>Sheila's work is bold and beautiful, creating a kaleidoscope of colors and joyful emotions. It floors me every time I see it.<\/em>\"<\/p>","bios_image":"shopify:\/\/shop_images\/SharonHeitzenroder_website_headshot.jpg","bios_email":"sharon@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/sharonheitzenroder\/"}},"select_YEBdfK":{"type":"select","settings":{"bios_name":"Zara Makhdoom","bios_pronouns":"","bios_title":"Art Advisor","bios_location":"London, UK","bios_company":"","bios_company_link":"","bios_details":"<p>Zara Makhdoom (she\/her) is an art advisor and consultant with a passion for creating meaningful artistic experiences. With a diverse background spanning from gallery management to research, she brings a wealth of expertise to her clients and partners. With a steadfast commitment to enhancing artistic experiences she continues to be an advocate for meaningful and inclusive art engagement. In her free time Zara likes to discover new restaurants, try new recipes, and travel. She loves spending time outside hiking and bird watching.<\/p>","bios_artwork":"feather-lillies-juliana-alonso","bios_quote":"<p>\"<em>I love the way this artwork taps into powerful themes of youth, memory and home. I am also interested in the way that Juliana combines using watercolor and digital techniques into her practice.<\/em>\"<\/p>","bios_image":"shopify:\/\/shop_images\/ZaraMakhdoom_website_headshot.jpg","bios_email":"zara@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/zara-makhdoom000\/"}},"select_6eXRC4":{"type":"select","settings":{"bios_name":"Addi Spearman","bios_pronouns":"","bios_title":"Art Advisor","bios_location":"Charleston, SC","bios_company":"","bios_company_link":"","bios_details":"<p>Addi Spearman (she\/her) has spent over five years representing ArtLifting artists and connecting corporate clients with meaningful artwork collections. She is passionate about promoting equity and creating conversation through artwork. Outside of work, she can often be found laughing with her husband and sons, baking gluten-free treats, and trying new restaurants.<\/p>","bios_artwork":"i-contain-multitudes-justin-jude-carroll","bios_quote":"<p>\"<em>I love this work for the colors, the inspiration, and process behind it. It reminds me of the importance of learning and growing throughout life!<\/em>\"<\/p>","bios_image":"shopify:\/\/shop_images\/AddiSpearman_website_headshot.jpg","bios_email":"addi@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/addisen-spearman\/"}},"select_nNf6tr":{"type":"select","settings":{"bios_name":"Lexie Craddock","bios_pronouns":"","bios_title":"Market Development Associate","bios_location":"Denver, CO","bios_company":"","bios_company_link":"","bios_details":"<p>As an art advisor, Lexie Craddock (she\/her) works in partnership with clients to create inclusive and impactful spaces that contribute to a more accessible art world. Lexie brings over ten years of experience in sales, business development and marketing. She started her career working for major alcohol brands and later in engineering and tech. Lexie is an artist who loves lounging on beaches and getting lost in new cities.<\/p>","bios_artwork":"aurora-justin-ellis","bios_quote":"<p>\"<em>I love how Justin transformed a moment of despair into a beautiful image of hope for the future.<\/em>\"<\/p>","bios_image":"shopify:\/\/shop_images\/LexieCraddock_website_headshot.jpg","bios_email":"lexie@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/lexiecraddock\/"}},"select_WK9rYR":{"type":"select","settings":{"bios_name":"Farra Pierre","bios_pronouns":"","bios_title":"Artist Program Coordinator","bios_location":"Brockton, MA","bios_company":"","bios_company_link":"","bios_details":"<p>Farra Pierre (she\/her) is an artist from Massachusetts who has experience navigating the business of art. Her background in the arts stretches all the way back to childhood where she first started selling her own work. She served as an advisor for local Boston artists looking for ways to form creative businesses, and she helped connect artists to different creative opportunities in New England. Farra's experience in the business of art has led her to ArtLifting, where she uses her skills to help artists living with disability and\/or houselessness achieve success.<\/p>","bios_artwork":"letting-go-aneliya-kostova","bios_quote":"<p>\"<em>I love this piece because of the way the colors interact with one another. The flow of the lines correspond so well with Aneliya's color palette; it's hard for me not to get lost in this piece.<\/em>\"<\/p>","bios_image":"shopify:\/\/shop_images\/FarraPierre_website_headshot.jpg","bios_email":"farra@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/farra-pierre-mps-1709b1b9\/"}},"select_KMezRy":{"type":"select","settings":{"bios_name":"Amy Sargeant","bios_pronouns":"","bios_title":"Artist Program Coordinator","bios_location":"San Luis Obispo, CA","bios_company":"","bios_company_link":"","bios_details":"<p>Amy Sargeant (she\/her) is an art educator with a career spanning from university teaching to museum education. Amy is also a ceramic artist, art writer, and trained disability advocate. Having received her education and pursued her career in Portland, Oregon and London, UK, she had enough of the rain and now resides happily on the California central coast with her husband, two kids, and rescue pup Maple. Amy enjoys reading, writing, hiking, and all things art. She hates to run but loves to bake, so practices both in equal measures to even things out.<\/p>","bios_artwork":"moving-pearls","bios_quote":"<p><em>\"I'm always attracted to varied markmaking, layered upon washes of color. Moving Pearls attracts the viewer's attention from a distance, and is equally satisfying when looking closely.\"<\/em><\/p>","bios_image":"shopify:\/\/shop_images\/AmySargeant_website_headshot_45d93fda-e69c-4454-badb-fafd681a07c5.jpg","bios_email":"amy@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/amy-sargeant-a76b678\/"}},"select_LAwLpQ":{"type":"select","settings":{"bios_name":"Olivia Kascak","bios_pronouns":"","bios_title":"Associate Curator","bios_location":"Asheville, NC","bios_company":"","bios_company_link":"","bios_details":"<p>As an Associate Curator, Olivia Kascak (she\/her) makes thoughtful artwork recommendations for clients and advises on the development of ArtLifting's artwork collection. Olivia possesses a background in the field of Interior Design, with experience garnered from her time at Design Within Reach and several small businesses within the industry. She truly believes that design has the power to influence the well-being of individuals and society at large. Living by example, Olivia served an AmeriCorps term as Construction Crew Leader at Austin Habitat for Humanity where she assisted in providing affordable, well-designed homes to Texas residents. Olivia is excited to channel her passion for impactful design into her work at ArtLifting.<\/p>","bios_artwork":"veiled","bios_quote":"<p>\"<em>This piece transports me to the Blue Ridge Mountains, a place that has become near and dear to my heart. The mountains allow me to slow down, breathe in the crisp air, and enjoy the beauty of nature surrounding me.<\/em>\"<\/p>","bios_image":"shopify:\/\/shop_images\/OliviaKascak_website_headshot.jpg","bios_email":"olivia@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/olivia-kascak-554371a8\/"}},"select_qd6Q6w":{"type":"select","settings":{"bios_name":"Jess Machacek","bios_pronouns":"","bios_title":"Associate Curator","bios_location":"Athens, GA","bios_company":"","bios_company_link":"","bios_details":"<p>Jess Machacek (she\/her) is an artist and designer with extensive experience working in studio management, production and higher education. She is thrilled to showcase the talent of ArtLifting’s artists through design and storytelling, while helping clients visualize impactful spaces that reflect the wider aims of their mission and core values. Jess’s interests outside of work center around art making, plants, and going on adventures to photograph inspiration. She also serves on the board of a nonprofit that is committed to accessibility, sustainability, and the advancement of music and arts education for local youth.<\/p>","bios_artwork":"untitled-57","bios_quote":"<p>\"<em>I’m always drawn to minimal compositions and pattern formation. The subtle variations in this piece are so captivating – I love the softness and elegance that is achieved through shifts in line weight, texture and quiet moments of color.<\/em>\"<\/p>","bios_image":"shopify:\/\/shop_images\/JessMachacek_website_headshot.jpg","bios_email":"jess@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/jess-machacek\/"}},"select_QfFFD7":{"type":"select","settings":{"bios_name":"Matthew Beckshaw","bios_pronouns":"","bios_title":"Project Manager","bios_location":"Portland, ME","bios_company":"","bios_company_link":"","bios_details":"<p>Before ArtLifting, Matthew Beckshaw (he\/him) worked at two small art museums in southern Maine, helping to develop new fundraising strategies and improving inventory records. On a typical weekend, you’ll find him browsing through antique stores and flea markets across New England, searching for mid-century mod planters and ceramics to add to his vast collection. Matthew is happy to have found a career outside of the museum and gallery world – it’s an honor for him to work so closely with a group of incredibly talented, underrepresented artists who inspire him every day. <\/p>","bios_artwork":"community-vanessa-starr","bios_quote":"<p><em>\"I absolutely adore the shapes in this artwork – and the darker color tones make me feel warm and protected. A sense of community is so important.\"<\/em><\/p>","bios_image":"shopify:\/\/shop_images\/MattBeckshaw_website_headshot_45e32285-d6ab-4c23-9ff2-50cf3a0185b8.jpg","bios_email":"matthew@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/matthew-beckshaw-3a0490132\/"}},"select_RwbP4f":{"type":"select","settings":{"bios_name":"Aubree Mladenovic","bios_pronouns":"","bios_title":"Project Manager","bios_location":"Tacoma, WA","bios_company":"","bios_company_link":"","bios_details":"<p>Aubree Mladenovic (she\/her) is an arts professional with experience across a broad range of sales and creative environments. From restaurant design to antique maps to contemporary art galleries, she has enjoyed helping clients bring their project visions to life. Aubree is passionate about creating opportunities for ArtLifting artists and sharing their stories. Outside of work, she is a devoted concertgoer, reader, and visual artist. <\/p>","bios_artwork":"mexico-city-pastels","bios_quote":"<p><em>\"I love this painting by Kevin Hosseini because it reminds me of my love for traveling and motivates me to be adventurous when my spirit is low.\"<\/em><\/p>","bios_image":"shopify:\/\/shop_images\/AubreeMladenovic_website_headshot.jpg","bios_email":"aubree@artlifting.com","bios_linkedin":"www.linkedin.com\/in\/aubree-mladenovic"}},"select_Qd7rCE":{"type":"select","settings":{"bios_name":"India Stevens","bios_pronouns":"","bios_title":"Project Manager","bios_location":"Durham, NC","bios_company":"","bios_company_link":"","bios_details":"<p>India (she\/her) brings years of project management expertise within the art world, with a focus on developing operational efficiencies and successfully managing projects ranging from hospitality to multifamily environments. Passionate about the intersection of art and community, India is thrilled to return to the art space through her role at ArtLifting — connecting with partners, collaborating with vendors, and advocating for artists.<br\/><br\/>When she's not coordinating projects, you can find India exploring new restaurants, getting creative in the kitchen, browsing local farmers markets, solving puzzles, or soaking in the energy of a concert.<\/p>","bios_artwork":"queens-gal-3-aimee-hofmann-original","bios_quote":"<p>\"I love the colors and movement in this painting. It feels fun, bright, and joyful, and I love the different textures throughout. It reminds me of home, the energy, color, and rhythm of New York City, where I grew up and where the artist drew inspiration.\"<\/p>","bios_image":"shopify:\/\/shop_images\/IndiaStevens_TeamHeadshot.jpg","bios_email":"india@artlifting.com","bios_linkedin":"https:\/\/www.linkedin.com\/in\/indiamwright\/"}},"select_QPRwFy":{"type":"select","settings":{"bios_name":"Jill Houghton","bios_pronouns":"","bios_title":"Board Member","bios_location":"","bios_company":"","bios_company_link":"","bios_details":"<p>Jill Houghton (she\/her) is President & Chief Executive Officer of <a href=\"https:\/\/disabilityin.org\/\" target=\"_blank\" title=\"https:\/\/disabilityin.org\/\">Disability:IN<\/a>, the leading global nonprofit organization for advancing business disability inclusion and equality. Her more than 25 years of diverse leadership experience driving disability inclusion was ignited by challenges she experienced having a learning disability.<\/p><p>Ms. Houghton leads a team of talented and diverse individuals at Disability:IN, including people with disabilities, who are working to build an inclusive global economy that enables people with disabilities to participate fully and meaningfully. Their work has empowered nearly 500 leading brands to advance disability inclusion and equality through groundbreaking programs.<\/p><p>A well-known speaker and expert on corporate disability inclusion, Ms. Houghton has testified before the U.S. Senate and U.S. House of Representatives on issues related to businesses’ commitment to recruit, hire and retain employees with disabilities. Ms. Houghton has been featured in Bloomberg, Business Insider, CNBC TV, Fast Company, Forbes, Fortune, MSN, Protocol and other notable outlets. She is a member of the Communications Equity & Diversity Council of the Federal Communications Commission. Additionally, she serves on the Fifth Third Bank National Community Advisory Forum, M&M’S FUNd Advisory Council, and the Joe DiMaggio Children’s Hospital Patient and Family Advisory Council.<\/p>","bios_artwork":"blue-crush-sunrise-aimee-hofmann","bios_quote":"","bios_image":"shopify:\/\/shop_images\/JillHoughton_website_headshot.jpg","bios_email":"","bios_linkedin":""}},"select_4P7kB9":{"type":"select","settings":{"bios_name":"Frank Moss","bios_pronouns":"","bios_title":"Board Member","bios_location":"","bios_company":"","bios_company_link":"https:\/\/www.media.mit.edu\/","bios_details":"<p>While director of the MIT Media Lab, Frank developed a passion for the power of creativity and technology to improve the lives of people living with disabilities. In ArtLifting, Frank has found a social enterprise that truly embodies this principle. He has had a 35-year career as a high-tech, biotech, and health-tech entrepreneur and enjoys pen-and-ink drawing in his spare time. Frank holds a BSE from Princeton and MS and Ph.D. from MIT.<\/p>","bios_artwork":"crystal-rainbows","bios_quote":"","bios_image":"shopify:\/\/shop_images\/FrankMoss_website_headshot.jpg","bios_email":"","bios_linkedin":""}}},"block_order":["select_fAhrVt","select_gfxzDR","select_8iC8Aa","select_zknMDB","select_XhxtPt","select_9FbfJ9","select_wBAPyD","select_mT3rqg","select_WqwA7d","select_xHm8Ad","select_R63Ngb","select_PJgYGn","select_XQPcwN","select_r3fqiC","select_b79CbE","select_qwXaCp","select_VehT4G","select_8j3bzN","select_zCM64w","select_YEBdfK","select_6eXRC4","select_nNf6tr","select_WK9rYR","select_KMezRy","select_LAwLpQ","select_qd6Q6w","select_QfFFD7","select_RwbP4f","select_Qd7rCE","select_QPRwFy","select_4P7kB9"],"settings":{}}},"order":["main","section_richtext_4Wm6eT","section_bios_irCpHr"]}