{"sections":{"main":{"type":"page","disabled":true,"settings":{"kicker":"Our Team","kicker_size":3,"show_title":false,"title_size":8,"show_content":true,"content_size":5,"align_text":"text-left","text_color":"text--neutral","bg":"palette--light bg--neutral","width":"wrapper","padding_top":36,"padding_bottom":36}},"section_richtext_4Wm6eT":{"type":"section-richtext","blocks":{"kicker_7HhMVK":{"type":"kicker","settings":{"kicker":"","enable_line":false,"text_size":4}},"heading_ADmgLV":{"type":"heading","settings":{"heading":"ArtLifting Advisory Board","text_size":8}},"text_PaQzBx":{"type":"text","settings":{"text":"<p>ArtLifting is proud to be guided by a dynamic Advisory Board whose diverse expertise and personal passion for our mission help shape our strategic direction and amplify our mission.<\/p><p><br\/>Their leadership strengthens our impact, supports sustainable growth, and ensures we continue advancing opportunities for artists with disabilities while delivering value to the business community.<\/p><p><br\/>ArtLifting leadership is also supported by the Artist Advisory Board. <a href=\"\/pages\/artist-advisory-board\" title=\"Artist Advisory Board (2023 - 2024)\">Meet our current cohort here.<\/a><\/p>","text_size":4,"text_columns":1}},"button_gVq8dM":{"type":"button","settings":{"link_text_1":"Contact Us","link_1":"shopify:\/\/pages\/contact-us","button_size_1":"btn--large","button_style_1":"btn","button_color_1":"btn--secondary","link_text_2":"Subscribe","link_2":"http:\/\/eepurl.com\/g8n9ij","button_size_2":"btn--large","button_style_2":"btn","button_color_2":"btn--neutral","link_text_3":"","link_3":"","button_size_3":"btn--large","button_style_3":"btn","button_color_3":"btn--neutral"}}},"block_order":["kicker_7HhMVK","heading_ADmgLV","text_PaQzBx","button_gVq8dM"],"settings":{"align_text":"text-left","text_color":"text--neutral","bg":"palette--light bg--neutral","content_width":850,"width":"wrapper","padding_top":36,"padding_bottom":36}},"section_bios_Ma6Fyz":{"type":"section-bios","blocks":{"select_nFypAW":{"type":"select","settings":{"bios_name":"Andrew Hallissey","bios_pronouns":"","bios_title":"Chief Executive Officer - Occupier Services, Global","bios_location":"","bios_company":"Colliers","bios_company_link":"https:\/\/www.colliers.com\/en","bios_details":"<p>Andrew serves as the Chief Executive Officer for the Colliers' Global Occupier Services business. He is responsible for executing the strategic vision, client experience, growth agenda, and leading the global organization of regional and functional commercial real estate experts who provide memorable service for Colliers' clients, leveraging a global platform of 500 offices in 68 countries worldwide. In addition to his global leadership responsibility, Andrew also directly leads Colliers' Occupier Services business in the EMEA region.<\/p>","bios_artwork":"weekend-vibes-3","bios_quote":"<p>\"Art has the unique power to inspire the human soul and reimagine a disability as a creative strength.  What a powerful way to make a difference in the world.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_AndrewHallissey.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/andrew-hallissey-971000165\/"}},"select_bT4qFK":{"type":"select","settings":{"bios_name":"Becky Curran","bios_pronouns":"","bios_title":"Senior Director, Stakeholder Engagement","bios_location":"","bios_company":"Disability:IN","bios_company_link":"https:\/\/disabilityin.org\/","bios_details":"<p>Becky Curran is the Senior Director of Stakeholder Engagement at Disability:IN, where she leads new partnerships and disability inclusion efforts, including the Disability Equality Index. Since joining in 2017, she’s helped grow Index participation from 110 to 542 companies. <\/p><p>With a marketing degree from Providence College, Becky began her career in entertainment at CAA and CBS, co-founded the Catalina Film Festival, and launched DisABILITY In Media. A global speaker and advocate, she later worked at SAG-AFTRA supporting diversity strategies. Becky serves on multiple advisory boards and remains a committed leader advancing inclusion for people with disabilities across media, business, and society.<\/p>","bios_artwork":"san-francisco-golden-gate-bridge-philip-ma","bios_quote":"<p>\"I'm passionate about advancing disability inclusion globally and helping create a world where all people, of all abilities, can thrive.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_BeckyCurran.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/beckymotivates\/"}},"select_fNiET7":{"type":"select","settings":{"bios_name":"Brian Cusack","bios_pronouns":"","bios_title":"Principal","bios_location":"","bios_company":"PartnerOcean LLC","bios_company_link":"","bios_details":"<p>Brian has spent his career leading sales organizations at high growth, data driven companies. Today he applies that experience to support for profit and non-profit organizations in the pursuit of their goals and missions.<\/p>","bios_artwork":"fenway-park-art-print","bios_quote":"<p>\"I support ArtLifting for the impact of its mission and also for the way we can see and feel that impact in our community. A successful ArtLifting engagement is a win-win-win: for companies, for employees, and of course, for ARTISTS.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_BrianCusack.jpg","bios_email":"","bios_linkedin":""}},"select_8ViJXT":{"type":"select","settings":{"bios_name":"Bryan Berthold","bios_pronouns":"","bios_title":"Global Lead Workplace Experience","bios_location":"","bios_company":"Cushman & Wakefield","bios_company_link":"https:\/\/www.cushmanwakefield.com\/en\/united-states","bios_details":"<p>Bryan Berthold is the Global Lead of Workplace Experience at Cushman & Wakefield’s Total Workplace practice, where he spearheads the Experience per Square Foot™ (XSF) diagnostic. As an expert in workplace experience, Bryan assists clients in diagnosing their employees' experiences, identifying key drivers, and aligning operational investments to enhance overall satisfaction and improve employee experience and engagement.<br\/><br\/>A top-rated faculty member at Corenet Global and a recognized thought leader in workplace experience, Bryan provides valuable insights into the pandemic's effects on human behavior worldwide. He possesses extensive knowledge of future trends and offers perspectives on the evolving nature of work, including remote work and the future of office spaces, to support a dynamic workplace and inspire the workforce.<br\/><br\/>Bryan chairs Cushman & Wakefield’s LEAD ERG (Leading the Education and Awareness of Disabilities), dedicated to fostering an inclusive work environment that removes barriers for individuals affected by disabilities.<br\/><br\/>With over 20 years of experience in developing real estate and workplace strategies, Bryan is a licensed architect who has held executive real estate positions at several prominent companies, including Capital One, Truist Bank, TD Financial Group, Washington Mutual, and Fleet Bank (now Bank of America). Bryan currently serves on the Corenet Global Finance Committee.<br\/><br\/>Bryan resides in Alpharetta, GA with his wife Carol and has two daughters, Amanda and Erica.<\/p>","bios_artwork":"contrails-of-jupiter-jonah-dillon","bios_quote":"<p>\"As the Global Lead of Workplace Experience at Cushman & Wakefield, I have spent over a decade studying human behavior in the workplace. The onset of the pandemic highlighted a significant decline in employee wellbeing, primarily due to mental health concerns and burnout. Driven by a passion to improve people's lives and explore how the work environment can enhance mental health, I became involved with our company's employee resource group, LEAD (Leading the Education and Awareness of Disabilities). Through this group, I gained a deeper understanding of neurodiversity and the various physical and mental conditions people face daily.<br\/><br\/>My journey led me to explore how work environments can incorporate mind-friendly design concepts—such as the use of color, light, air, materials, art, furniture, and layouts—to improve the quality of people's lives. I have come to appreciate the uplifting power of art in these environments. When I first learned about ArtLifting's mission to integrate art created by artists impacted by disabilities into our world, I was truly inspired. This is a mission I passionately support.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_BrianBerthold.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/bryanberthold\/"}},"select_CGejUR":{"type":"select","settings":{"bios_name":"Bryan Parker","bios_pronouns":"","bios_title":"Global SPO Director","bios_location":"","bios_company":"Cushman & Wakefield","bios_company_link":"https:\/\/www.cushmanwakefield.com\/en\/united-states","bios_details":"<p>For 25 years Bryan has been at heart of workplace innovation, spearheading cross-functional collaboration that reshapes how employees engage with one another through the physical and digital workplace. With a passion for crafting experiences that turn office spaces into hubs of creativity, connection, and productivity he has redefined the workplace experience through cutting-edge strategies, increasing employee engagement and collaboration.<\/p>","bios_artwork":"reading-is-fundamental-ian-shearer","bios_quote":"<p>I proudly support ArtLifting because their work goes far beyond commerce — it’s about creating meaningful spaces and products that reflect the richness of human experience.<br\/><br\/>ArtLifting promotes dialogue, diversity, and dignity not only for the artists they represent but also for those who engage with their art. Every piece tells a story, sparks conversation, and invites us to see the world through a more inclusive lens. By championing underrepresented voices, ArtLifting fosters a culture of empathy and connection — values that resonate deeply with me both personally and professionally.<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_BryanParker.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/bryanrwparker\/"}},"select_7WnH8U":{"type":"select","settings":{"bios_name":"Chad Doellinger","bios_pronouns":"","bios_title":"Chief Legal & Administrative Officer","bios_location":"","bios_company":"CBRE","bios_company_link":"https:\/\/www.cbre.com\/","bios_details":"<p>Chad Doellinger has been CBRE’s Chief Legal & Administrative Officer and Corporate Secretary since January 2025. As Chief Legal Officer, he oversees Global Governance, which encompasses legal, risk, ethics & compliance, and global insurance. As Chief Administrative Officer, he manages corporate real estate, human resources, and procurement. Previously, he was CBRE’s General Counsel and Chief Transformation Officer. Chad is the Executive Sponsor of CBRE's Abilities Employee Business Resource Group. Before joining CBRE in 2020, he was a partner at Greenberg Traurig and head of complex litigation at Walmart. He previously served as a Lecturer in Law at the University of Chicago.<\/p>","bios_artwork":"untitled-1-tim-stone","bios_quote":"<p>\"I’m deeply committed to raising awareness around disabilities and housing insecurity and providing support for those affected. ArtLifting not only fosters creativity and inclusivity but also helps these artists gain financial independence and confidence. On a personal note, I have children with disabilities who have benefitted tremendously from art to express themselves, cope with challenges, and build self-confidence and personal identity.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_ChadDoellinger.jpg","bios_email":"","bios_linkedin":"http:\/\/linkedin.com\/in\/chaddoellinger"}},"select_nRqDbN":{"type":"select","settings":{"bios_name":"Christina Luconi","bios_pronouns":"","bios_title":"Owner","bios_location":"","bios_company":"People Innovations","bios_company_link":"","bios_details":"<p>Christina Luconi leads People Innovations, focused on innovative people strategies for start-ups and high growth companies. Previously Chief People Officer at Rapid7,  she was responsible for the entire employee lifecycle, with critical focus on recruiting stellar talent, architecting and inspiring corporate culture, and “scaling with soul.” She also held leadership roles at @stake and Sapient, driving growth and aligning business and people strategies. Christina advises MIT’s Martin Trust Center for Entrepreneurship, is Vice Chair of Hack.Diversity, and serves on multiple boards. She holds a B.A. in psychology from George Washington University and an M.S. in organizational administration from Boston University.<\/p>","bios_artwork":"thrive-matt-sesow","bios_quote":"<p>\"I'm a huge fan of the mission of ArtLifting's work. I had the benefit of being a corporate partner through our work together at Rapid7, and was so bought in, I've purchased several pieces for my own home. Nothing makes me happier when you can open doors for others and celebrate incredible talent at the same time.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_ChristinaLuconi.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/peopleinnovator\/"}},"select_VqUwFx":{"type":"select","settings":{"bios_name":"David Kamen","bios_pronouns":"","bios_title":"VP Global Workplace and Operations","bios_location":"","bios_company":"Cigna","bios_company_link":"https:\/\/www.cigna.com\/","bios_details":"<p>David is currently the Global Workplace leader at Cigna and has over 20 years of experience in leading global corporate real estate organizations. He’s previously worked with organizations such as Ernst & Young and Aon, amongst others. . David focuses on enhancing workplace experience, leveraging technology and the human experience to create the most productive workplaces. He excels in managing global real estate portfolios to enhance and align with company goals. His strategic vision and leadership have consistently driven impactful real estate solutions that align with organizational objectives and foster employee productivity and satisfaction.<\/p>","bios_artwork":"the-planetary-groove","bios_quote":"<p>\"We are looking to transform our offices' and warehouses' workplaces to a higher level of employee experience. This program is a perfect example to help support, this artistic community, while also connecting on different levels with our employees, connecting to our internal communities, and supporting our diverse employee base. ArtLifting helps create unique and meaningful spaces and products, making our society more inclusive and compassionate.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_DavidKamen.jpg","bios_email":"","bios_linkedin":"http:\/\/www.linkedin.com\/in\/davidkamen"}},"select_YYg6xw":{"type":"select","settings":{"bios_name":"Diane Hessan","bios_pronouns":"","bios_title":"CEO","bios_location":"","bios_company":"Salient Ventures","bios_company_link":"https:\/\/dianehessan.com\/salient","bios_details":"<p>Diane Hessan is an award-winning market researcher and innovator, a seasoned board director (including Panera, Eastern Bank, and more), and a nationally recognized expert on the American voter. She is CEO of Salient Ventures, which helps accelerate the next generation of startups in tech. In that capacity, she has championed over 100 startups in the Boston area and beyond.<\/p><p>She is the founder and former CEO of C Space, formerly called Communispace, which was the first company to leverage social media to help companies get insight and inspiration from their consumers. <\/p><p>Diane has a BA from Tufts, an MBA from Harvard, and is a member of the Market Research Hall of Fame.<\/p>","bios_artwork":"friendly-observer","bios_quote":"<p>\"ArtLifting transforms the lives of its artists by giving them a chance to show and promote their work all over the world – and it transforms the workplaces and homes of every one of its clients, by creating meaningful and beautiful environments in which to live and work.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_DianeHessan.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/diane-hessan-2118457\/"}},"select_8tRGHi":{"type":"select","settings":{"bios_name":"Don Watson","bios_pronouns":"","bios_title":"SVP Real Estate, Facilities Management, and EHS","bios_location":"","bios_company":"Oracle","bios_company_link":"https:\/\/www.oracle.com\/","bios_details":"<p>Don joined Oracle in January 2021 and is responsible for Global Real Estate, Facilities, and EHS&S and serves as the co-executive sponsor to Oracle’s Diverse Abilities Network.  He spent 13 years with Merck leading the Global Workplace and Enterprise Services Organization (also executive sponsor to the capAbility network) and 12 years at Stepan as a Plant Manager.  He has a passion for disability inclusion in the facility-built environment.  Don holds a Bachelor of Science Degree in Chemical Engineering from Bucknell University and a MBA from Seton Hall University; and is a past president for NJ CoreNet and served on the board of directors of the NJ Chemistry Council.<\/p>","bios_artwork":"forever-in-motion-nick-morse","bios_quote":"<p>\"ArtLifting, a company founded with a noble mission, aims to empower people with disabilities. Through the power of art, they foster social and community connections, paving the way for employment prospects, and enhancing the quality of life for those who just need that one opportunity to showcase their talents and abilities.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_DonWatson.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/donwatson94\/"}},"select_MLHAPT":{"type":"select","settings":{"bios_name":"Douglas Edwards","bios_pronouns":"","bios_title":"President, Humana Military","bios_location":"","bios_company":"Humana","bios_company_link":"https:\/\/www.humana.com\/","bios_details":"<p>Douglas serves as President of Humana Military, where he leads an organization of 3,000+ professionals and service providers across all facets of business performance.  He also serves on the Board of Directors for DIRTT (TSX: DRT) and Board of Advisors for Kolar.<\/p>","bios_artwork":"untitled-3-yvette-original","bios_quote":"<p>\"ArtLifting’s mission is inspiring and aligns with the values of the organization I’m a part of.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_DouglasEdwards.jpg","bios_email":"","bios_linkedin":"http:\/\/www.linkedin.com\/in\/edwardsdouglas"}},"select_XXt8GJ":{"type":"select","settings":{"bios_name":"Dustin Sarnoski","bios_pronouns":"","bios_title":"Head of Global Realty","bios_location":"","bios_company":"State Street Corporation","bios_company_link":"https:\/\/statestreet.com\/","bios_details":"<p>Dustin Sarnoski is the Head of Global Realty for State Street Corporation. In this role, he oversees ~7M square feet of operational real estate – including offices and data centers – across more than 25 countries, with an annual operating budget in excess of $450M.<\/p><p>Dustin is active with charities in the Greater Boston area, currently serving as the Chair of the Board of Trustees of St. Mary’s Center for Women and Children and on the Advisory Committee for ArtLifting, and previously having served on the Board of Directors of the Downtown Boston Business Improvement District (Boston BID), the Fort Point Arts Community (FPAC), and Bread of Life.<\/p>","bios_artwork":"ju-suis-malade-shana-stern-original","bios_quote":"<p>\"ArtLifting acts as a conduit between large corporate consumers of art and artists who may not have had access through typical channels. The artists stories are compelling, and – besides producing beautiful and thought-provoking pieces – provide a richer experience for employees and visitors to our space who are moved by each artist’s work and background. <\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_DustinSarnoski.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/dustin-sarnoski\/"}},"select_eNTEFg":{"type":"select","settings":{"bios_name":"Frederico Egli","bios_pronouns":"","bios_title":"Head of Real Estate, US","bios_location":"","bios_company":"IBM","bios_company_link":"https:\/\/www.ibm.com\/us-en","bios_details":"<p>Frederico brings over 20 years of experience in real estate and development, with a strong track record in executive roles at companies such as Wal-Mart, Groupe Casino, and IBM. Originally from Brazil and based in the U.S. since 2022, he is passionate about art and community service, and committed to supporting purpose-driven initiatives.<\/p>","bios_artwork":"ink-and-tentacles-rose-kamma-morrison","bios_quote":"<p>\"Supporting ArtLifting’s mission aligns deeply with both professional and personal values. With a long career in real estate and development, there’s a strong appreciation for the power of art to transform spaces – but even more so, a belief in its ability to uplift people and communities. ArtLifting creates opportunities for artists who are often overlooked, and that resonates with a passion for community service and creating inclusive environments where everyone has a chance to thrive.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_FredericoEgli.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/frederico-egli-41495535\/"}},"select_mnhYXL":{"type":"select","settings":{"bios_name":"Harry Smith","bios_pronouns":"","bios_title":"Professor","bios_location":"","bios_company":"Central College","bios_company_link":"https:\/\/central.edu\/","bios_details":"<p>Harry Smith is a professor at his alma mater Central College in Pella, Iowa, where he teaches a seminar on curiosity and adaptability. Until spring of 2024, Smith was a reporter for NBC News. Before that he worked as a reporter and anchor at CBS News. He also hosted <em>Biography<\/em> at A&E.<\/p><p>Smith has reported multiple stories from all fifty states and filed pieces from each continent. He has interviewed a passel of presidents and plenty of superstars. In a network career spanning nearly forty years, Smith often found his favorite stories in places far from the headlines.<\/p><p>He has won four Emmys, a Peabody and is the recipient of The Edward R. Murrow Lifetime Achievement Award in Journalism.<br\/>He is married to Sports Broadcasting Hall of Famer, Andrea Joyce.<\/p>","bios_artwork":"sunglasses-at-night-3-aimee-hofmann","bios_quote":"<p>\"ArtLifting gives voice to the voiceless.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_HarrySmith.jpg","bios_email":"","bios_linkedin":""}},"select_BRhY6B":{"type":"select","settings":{"bios_name":"Jason Pugh","bios_pronouns":"","bios_title":"Principal & Global Director of Inclusion","bios_location":"","bios_company":"Gensler","bios_company_link":"https:\/\/www.gensler.com\/","bios_details":"<p>Jason Pugh, NOMAC, AIA, AICP, LEED AP, is a licensed architect, certified planner, and a Principal at Gensler where he serves as the Global Director of Inclusion. As a firmwide leader based in Chicago, Jason promotes Gensler’s commitment to its Strategies to Build a Just and Inclusive Future while addressing the low representation, disparities, and unique challenges diverse practitioners face across the building design industry. <\/p><p>Jason is passionate about developing underserved communities and the next generation of designers, architects, planners, and activists. He leads projects that engage the community at-large, shepherding them from community-based comprehensive plans through full construction. He’s driven by the belief that one project can change a community, and if we change enough communities, we can change the world.<\/p><p>Jason served as the 2021-2022 National President of NOMA (National Organization of Minority Architects) and currently sits on both the National and Chicago Executive Board for the ACE (Architecture, Construction, and Engineering) Mentor Program.<\/p>","bios_artwork":"currents-diana-de-avila","bios_quote":"<p>\"I support ArtLifting because it provides a platform for individuals facing significant challenges to share their creativity with the world. By connecting artists with disabilities with customers who value purpose-driven work, ArtLifting fosters both meaningful connections and the opportunity to enrich spaces with diverse artistic voices. <\/p><p>I believe in the transformative power of art to create more inclusive environments and drive social change, and ArtLifting plays a vital role in making this a reality for underrepresented artists.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_JasonPugh.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/jason-pugh-nomac-aia-aicp-leed-ap-0b86765\/"}},"select_3UgEHR":{"type":"select","settings":{"bios_name":"Jennifer Marko","bios_pronouns":"","bios_title":"Sr. Director, Global Real Estate Planning and Workplace Design","bios_location":"","bios_company":"NVIDIA","bios_company_link":"https:\/\/www.nvidia.com\/en-us\/","bios_details":"<p>Ms. Marko has been creating innovative and impactful interiors using data analytics and a creative mindset to support the global workforce within their workplaces for over 33 years.<\/p><p>She has spent half of her career as a service provider at architectural firms in San Francisco and NYC, creating effective workplaces and strategies for numerous Fortune 100 and Tech clients. The other half of her career has been within the real estate organizations of top global companies including NVIDIA, Salesforce, Genentech and AIG. Her focus at these high growth organizations has been to lead the workplace design and planning groups in creating dynamic workplaces, enhancing brand and culture through the built environment, forming and developing team members, implementing data-driven real estate solutions and establishing efficient real estate portfolio strategies.<br\/><br\/>Her passions include design, real estate, cooking shows, dogs, and spending quality time with family and friends.<\/p>","bios_artwork":"a-new-vision-brandon-allebach","bios_quote":"<p>\"ArtLifting's mission has a beautiful balance between having a positive impact for artists who appreciate support and sharing their gifts with the world. Being part of such an innovative and life-altering initiative resonates with how I personally and professionally live my life. It is a great honor to sit on the advisory board and support the team in any way that I can.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_JenniferMarko.jpg","bios_email":"","bios_linkedin":"http:\/\/linkedin.com\/in\/jenniferjmarko"}},"select_FUyJ9t":{"type":"select","settings":{"bios_name":"Jeri Ballard","bios_pronouns":"","bios_title":"EVP, Real Estate, Business Operations Centres & Corporate Travel","bios_location":"","bios_company":"Shell","bios_company_link":"https:\/\/www.shell.com\/","bios_details":"<p>Jeri Ballard is the Executive Vice President of Real Estate, Business Operations Centres, and Corporate Travel. She is responsible for leading a team that delivers the real estate and facilities management to Shell businesses in 40+ countries. This includes the land assembly, construction and management of offices, laboratories, worker accommodations, and land for renewables projects. In addition, her team manages one of the world’s largest in-house business service centre networks (25,000+ staff) and one of the largest corporate travel programs.<\/p><p>Jeri began her career with Westinghouse Electric and has held management positions with Asea Brown Boveri (ABB) and Dynegy Inc, where she was the Senior Director of Global Facilities Management. She joined Shell in Houston in 2004. She has been active in several industry and civic organizations including CoreNet Global, a corporate real estate industry association, where she is on the Board of Directors. <\/p><p>Jeri was honoured with being named one of the top 15 women in real estate by Corporate Real Estate Women (CREW) and named Corporate Real Estate professional of the year in Houston by CoreNet for her work on Hurricane Katrina business continuity efforts for Shell.<\/p><p>Jeri is a native of Ohio and received a Bachelor of Science in transportation logistics from The Ohio State University and a master’s degree in business administration with a concentration in international finance from the University of Connecticut. She is married and has a daughter. Her hobbies are photography, scuba diving, live music and trying to make time to keep her pilot’s license current.<\/p>","bios_artwork":"always-moving-forward-aimee-hofmann","bios_quote":"","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_JeriBallard.jpg","bios_email":"","bios_linkedin":""}},"select_kMVgeH":{"type":"select","settings":{"bios_name":"Jodi Goldstein","bios_pronouns":"","bios_title":"CEO","bios_location":"","bios_company":"The Harvard & MIT Cooperative Society","bios_company_link":"https:\/\/www.thecoop.com\/","bios_details":"","bios_artwork":"open-heart-sierra-barnes","bios_quote":"","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_JodiGoldstein.jpg","bios_email":"","bios_linkedin":""}},"select_4MYLct":{"type":"select","settings":{"bios_name":"John Moran","bios_pronouns":"","bios_title":"Director, Real Estate Design & Delivery, Americas","bios_location":"","bios_company":"Google","bios_company_link":"https:\/\/www.google.com\/","bios_details":"<p>With over a 20-year career in design and real estate, John has worked on projects across the globe at a variety of scales with a through line of sustainability, placemaking and human-centered design. John holds a Master of Architecture from the University of Pennsylvania and a Bachelor of Arts in International Relations from the Maxwell School at Syracuse University.<\/p>","bios_artwork":"33-state-street-allen-chamberland-original","bios_quote":"<p>\"Working with ArtLifting is perhaps the most direct way I've experienced in my corporate real estate career to provide a platform and support to deserving artists.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_JohnMoran.jpg","bios_email":"","bios_linkedin":""}},"select_9QBbmm":{"type":"select","settings":{"bios_name":"John Harthorne","bios_pronouns":"","bios_title":"Managing Director","bios_location":"","bios_company":"Two Lanterns Venture Capital","bios_company_link":"https:\/\/www.2l.vc\/","bios_details":"<p>John is the Founder & Managing Director of Two Lanterns Venture Partners, a seed fund investing in AI software startups poised to create massive impact. Prior to launching Two Lanterns in 2020, John was the Founder and 10-year-long CEO of MassChallenge, the most startup-friendly accelerator on the planet. <\/p><p>The World Economic Forum elected John as a Young Global Leader, and EY selected John as Social Entrepreneur of the Year in New England. John earned his MBA at MIT where he won the $100K Business Plan Competition and the Patrick J. McGovern Award for impact on quality and visibility of entrepreneurship.<\/p>","bios_artwork":"fan","bios_quote":"<p>\"ArtLifting is an inspiring organization that helps people overcome challenges to express themselves authentically while generating income and sharing their wonderful ideas and creations at scale.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_JohnHarthorne.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/jharthorne\/"}},"select_edDHiY":{"type":"select","settings":{"bios_name":"Kathy Klingler","bios_pronouns":"","bios_title":"Growth Leader \/ CMO \/ Board Member","bios_location":"","bios_company":"Brightcove","bios_company_link":"https:\/\/www.brightcove.com\/","bios_details":"<p>Kathy Klingler is a strategic marketing and communications leader with over 25 years of experience driving growth across financial services, healthcare, cybersecurity, education, media and SaaS. She has led transformative brand and go-to-market strategies at companies like Santander, Rapid7, Brightcove, and Blue Cross Blue Shield. She brings deep expertise in digital transformation, AI personalization, and customer engagement. Kathy is known for building high-performing teams and navigating complex, regulated industries. As a board member, she offers deep marketing and brand expertise, along with a passion for helping mission-driven organizations grow while preserving the DNA that makes them both authentic and impactful.<br\/><\/p>","bios_artwork":"burst-of-beauty-sheila-smith","bios_quote":"<p>\"I’ve spent my career helping organizations grow with purpose, and ArtLifting embodies the kind of mission that truly matters. Art has shaped my life – professionally and personally – so, the organization’s work to expand access to the art world for people with disabilities resonates deeply. It’s about far more than artwork on walls; it’s about visibility, opportunity, and belonging. In a world hungry for more authentic ways to reflect inclusion and social impact, this work meets a real need with authenticity and impact.\"<br\/><\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_KathyKlingler.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/kathyklingler\/"}},"select_QiNmR4":{"type":"select","settings":{"bios_name":"Kay Sargent","bios_pronouns":"","bios_title":"Director of Thought Leadership, Interiors","bios_location":"","bios_company":"HOK","bios_company_link":"https:\/\/www.hok.com\/","bios_details":"<p>Kay Sargent is a practicing, licensed, and certified Interior Designer, Author, and Director of Thought Leadership, Interiors at HOK. With 40 years of experience, she has a passion for using design to transform how and where people work. Kay leads project teams that solve clients’ business and organizational challenges related to real estate business process, strategic planning, workplace strategy, change management and designing for inclusion. <\/p><p>Kay is author of <em>Designing Neuroinclusive Workplaces<\/em> a book that addresses sensory processing, cognitive well-being and neurodiversity in the built environment, and why and how we need to address it to create neuroinclusive spaces. <\/p>","bios_artwork":"refuel-medora-frei","bios_quote":"<p>\"I believe in the inherit worth and dignity of all people. As a practicing designer, I embrace the notion that we need to create places where all can thrive. Supporting disabled individuals in their pursuit to enrich the spaces we occupy with beauty is a key step towards doing so.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_KaySargent.jpg","bios_email":"","bios_linkedin":"http:\/\/linkedin.com\/in\/kay-sargent-53b2431"}},"select_VpNiEp":{"type":"select","settings":{"bios_name":"Malisa Maynard","bios_pronouns":"","bios_title":"Chief Sustainability Officer","bios_location":"","bios_company":"Mohawk Industries","bios_company_link":"https:\/\/mohawkind.com\/","bios_details":"<p>Malisa Maynard is the Chief Sustainability Officer at Mohawk Industries, where she leads the company’s sustainability strategy to enhance and strengthen Mohawk’s overall performance. With three decades of experience in sustainability, her work focuses on driving product innovation and fostering positive environmental and societal change in a Fortune 500 environment.<\/p><p>Throughout her career she has served in sustainability leadership roles for numerous national trade organizations and believes collaboration is vital to learn from others and improve sustainability positioning. Most recently, she contributed to the International Living Future Institute's Regenerative Materials Movement, where she shared insights into how her ethos of environmental stewardship and inclusivity was cultivated through her upbringing in the rugged landscapes of the Rocky Mountains in Montana. She harbors a profound appreciation for the impact of our present actions on our future trajectory, firmly believing that a regenerative, equitable, and inclusive, climate-positive economy hinges on individuals driving transformative change.<\/p>","bios_artwork":"unexpected-love","bios_quote":"<p>\"The ArtLifting mission resonates deeply with me on both a personal and professional level. Growing up with two siblings who are both handicapped and extraordinary artists, I have witnessed firsthand the power of art to transcend physical limitations and serve as a profound medium of expression and creativity. Their journey has been nothing short of inspiring, as they have continually surmounted the challenges posed by their disabilities to create stunning and impactful works of art.<\/p><p>Supporting the ArtLifting mission is an extension of my commitment to creating a regenerative, equitable, and inclusive economy and is fueled by personal experiences and professional principles. My siblings' artistic achievements have shown me the transformative power of art, strengthening my support for ArtLifting and its mission to uplift and empower talented artists facing significant challenges.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_MalisaMaynard.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/malisa-maynard-b59777104\/"}},"select_ex4BLR":{"type":"select","settings":{"bios_name":"Matthew Hickey","bios_pronouns":"","bios_title":"Partner & Architect","bios_location":"","bios_company":"TWO ROW ARCHITECT","bios_company_link":"https:\/\/www.tworow.com\/","bios_details":"<p>Matthew Hickey, a Mohawk architect from Six Nations of the Grand River, is a partner at Two Row Architect, where he leads the design of culturally-rooted, land-based architecture across Turtle Island.<\/p><p>Guided by Haudenosaunee principles, his mission is to advance Indigenous sovereignty through architecture – centering food, water, land, and community in every project. His work promotes regenerative sustainability and place-keeping while challenging colonial systems of design.<\/p><p>Matthew is a tenure-track professor at OCAD University, a mentor with Nikibii Dawadinna Giigwag, a Waterfront Toronto Design Review Panelist, a ULI Advisory Committee member, and serves on the Board of the Art Gallery of Ontario.<\/p>","bios_artwork":"polyphonic-sky-lumi","bios_quote":"<p>\"I support ArtLifting’s mission because I believe in the power of art to honor everyone and everything – all our relations. As an architect and artist, my work is rooted in creating spaces that reflect care, respect, and belonging. I’m drawn to ArtLifting because it uplifts voices that are too often overlooked, not through charity, but by recognizing the inherent value and brilliance of each artist. Their mission aligns with my own commitment to design that restores balance, tells meaningful stories, and reflects a world where every being is seen, heard, and celebrated.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_MatthewHickey.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/matthew-hickey-b1549618\/"}},"select_xmxcY8":{"type":"select","settings":{"bios_name":"Melissa Whitehead","bios_pronouns":"","bios_title":"Engineering Leader & Consultant","bios_location":"","bios_company":"Independent","bios_company_link":"","bios_details":"<p>Melissa is a software engineering leader with over 20 years of experience in the fintech industry, spanning roles from hands-on software engineer to executive leadership. Since earning a degree in Computer Science from the University of Michigan, she has built a broad foundation across fintech companies at various stages of growth. Melissa currently operates independently and brings a pragmatic, people-centered approach to building scalable systems and high-performing teams.<\/p>","bios_artwork":"tiny-dancer-shana-stern-original","bios_quote":"<p>\"I support ArtLifting’s mission because I believe everyone deserves the opportunity to thrive. By empowering underserved artists to support themselves on their work, ArtLifting creates a ripple effect of dignity and inclusion, and enhances the spaces where people work, heal, and gather.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_MelissaWhitehead.jpg","bios_email":"","bios_linkedin":"http:\/\/www.linkedin.com\/in\/melissa-s-whitehead"}},"select_3WG7mE":{"type":"select","settings":{"bios_name":"Meredith McCormick","bios_pronouns":"","bios_title":"VP, Global Licensing Acquisitions","bios_location":"","bios_company":"Hallmark Cards Inc.","bios_company_link":"https:\/\/www.hallmark.com\/","bios_details":"<p>Meredith joined Hallmark in 2006 in product development with a linkage role to licensing. She soon joined the licensing organization in 2009, holding various roles on the team. In 2020, she assumed her current role of Vice President of Global Licensing Acquisitions. In this role, she works with the top licensors worldwide while overseeing the licensing strategies and partner portfolio to support Hallmark’s diverse product offering.<\/p>","bios_artwork":"practicing-nirvana-quana-madison","bios_quote":"<p>\"I am inspired by the incredible mission of ArtLifting sharing the talent of their artists to improve the lives of so many. The impact is truly life-changing.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_MeredithMcCormick.jpg","bios_email":"","bios_linkedin":"http:\/\/linkedin.com\/in\/meredith-mccormick-7148b96"}},"select_mBjNw8":{"type":"select","settings":{"bios_name":"Michael Beckerman","bios_pronouns":"","bios_title":"CEO","bios_location":"","bios_company":"CREtech","bios_company_link":"https:\/\/www.cretech.com\/","bios_details":"<p>Michael Beckerman has spent his entire career focused on the Built World, having built companies in the media relations and technology conference sectors. He is passionate advocate of the arts, sustainability, and active supporter of organizations that help underrepresented and disadvantaged professionals, tech founders, and artists.<\/p>","bios_artwork":"golden-hour-1-jeff-diener","bios_quote":"<p>\"ArtLifting is a wonderful organization that is truly changing the life’s of talented artists with disabilities and beautifying spaces and cities as a result.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_MichaelBeckerman.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/michael-beckerman?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=ios_app"}},"select_UWPy6N":{"type":"select","settings":{"bios_name":"Nastran Andersen","bios_pronouns":"","bios_title":"Chief Growth Officer","bios_location":"","bios_company":"Lumata Health","bios_company_link":"https:\/\/lumatahealth.com\/","bios_details":"<p>Nastran Andersen is a dynamic executive with nearly 30 years of experience driving revenue growth in the healthcare industry. She has a proven track record of leading high-performing teams across sales, marketing, and client success, fostering collaboration to achieve sustainable business expansion.<br\/><br\/>Nastran has worked with Fortune 10 and Fortune 500 companies, private equity-backed firms, as well as small to mid-sized organizations across multiple industries. <br\/><br\/>A skilled communicator and strategic thinker, she excels at translating vision into action, helping businesses scale efficiently while navigating complex market dynamics.<\/p>","bios_artwork":"fractured-but-not-broken-yvette-original","bios_quote":"<p>\"I support ArtLifting’s mission because I believe in the power of opportunity and the transformative impact of art. Everyone deserves a platform to share their talents, and ArtLifting provides artists with not just visibility, but dignity and economic empowerment. <\/p><p>As a business leader, I’ve seen firsthand how art can inspire, connect, and create meaningful environments. ArtLifting’s work goes beyond decoration – it fosters inclusion, social impact, and change. I’m honored to be part of an organization that champions talent, drives awareness, and builds a more equitable future through the power of creativity.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_NastranAndersen.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/nastran-andersen\/"}},"select_WtprMB":{"type":"select","settings":{"bios_name":"Nicolette Jaze","bios_pronouns":"","bios_title":"Head of Sustainability, Galvanize Real Estate","bios_location":"","bios_company":"Galvanize Climate Solutions","bios_company_link":"https:\/\/galvanizeclimate.com\/","bios_details":"<p>Prior to joining Galvanize as the Head of Sustainability for real estate, Nicolette served as VP of Client Engagement, Communications, and ESG at Esusu, a fintech\/proptech startup that reports on-time rental payments to consumer credit agencies with the goal of helping renters improve their credit scores and ultimately bridging the racial wealth gap. Prior to Esusu, Nicolette spent six years as a Vice President at Goldman Sachs developing and overseeing ESG integration initiatives for real estate, both within the Asset Management and Corporate Real Estate divisions.<\/p>","bios_artwork":"thirst-trap-carlos-canon","bios_quote":"<p>\"Purposeful procurement offers a fast-track opportunity for driving social impact in the built environment. ArtLifting presents a seamless alternative to conventional market choices, while also delivering added value to building owners, tenants, and the artists involved.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_NicoletteJaze.jpg","bios_email":"","bios_linkedin":""}},"select_iJqfa7":{"type":"select","settings":{"bios_name":"Paul Donhauser","bios_pronouns":"","bios_title":"VP, Global Real Estate, Facilities Operations, Environment, Health, Safety, Aviation, Security & Resiliency","bios_location":"","bios_company":"Boston Scientific Corporation","bios_company_link":"https:\/\/www.bostonscientific.com\/en-US\/home.html","bios_details":"<p>Paul has 30 years experience in supporting facilities sustaining operations, real estate transactions, workplace strategy, facility capital projects, environment pillar of corporate responsibility, health, and safety. He is well-versed in all facets of Global Facilities Infrastructure Management, inclusive of Optimizing Global Real Estate Portfolios, Facility Design & Construction, and Facility Management Excellence, supported over $2B in renovation and construction of existing and new BSC facilities around the world.<\/p><p>Paul spends his free time with his wife and two children, and enjoys scuba diving, boating, skiing, and snowmobiling. He also finds fulfillment in mentoring young minds in the field of facilities and engineering.<\/p>","bios_artwork":"colors-intersect","bios_quote":"<p>\"I support ArtLifting's mission because it empowers artists who are often overlooked –individuals with disabilities – by providing them with a platform to showcase and sell their work. Art has the power to change lives, not just through expression but through opportunity, dignity, and financial independence. By supporting ArtLifting, I'm helping to break down barriers and promote inclusivity, while celebrating the talent and resilience of these artists. It's a powerful intersection of creativity and social impact.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_PaulDonhauser.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/pauldonhauser\/"}},"select_CnYDAy":{"type":"select","settings":{"bios_name":"Peter Van Emburgh","bios_pronouns":"","bios_title":"Senior Managing Director, East Region","bios_location":"","bios_company":"Cushman & Wakefield","bios_company_link":"https:\/\/www.cushmanwakefield.com\/en\/united-states","bios_details":"<p>Peter is a corporate real estate services provider who leads global enterprise accounts in the East Region at Cushman & Wakefield Global Occupier Services. He spent 13 years at CBRE, most recently as Senior Vice President and Global Head of Real Estate, where Peter led a diverse and high-performing corporate real estate across a 6M+ square foot global portfolio spanning over 550 office locations. He was responsible for the award-winning Workplace360 program and was a proud supporter of deploying ArtLifting across CBRE's portfolio. Peter was named CoreNet Global’s Corporate Real Estate Executive of the Year in 2023.<\/p>","bios_artwork":"bw-dc-5-mike-hedrick","bios_quote":"","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_PeterVanEmburgh.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/petervanemburgh"}},"select_kkrK7y":{"type":"select","settings":{"bios_name":"Phil Kirschner","bios_pronouns":"","bios_title":"Founder","bios_location":"","bios_company":"PK Consulting","bios_company_link":"https:\/\/www.philkirschner.com\/","bios_details":"<p>Phil Kirschner is a leading voice in workplace experience and the future of work, with a 20-year track record spanning McKinsey, WeWork, JLL, and Credit Suisse. As Founder of PK Consulting, he helps organizations reimagine how, where, and why work happens. He partners closely with clients to navigate complex change, unlock new value through space and culture, and align management practices with organizational goals. Phil is deeply committed to creating inclusive, human-centric spaces and employee experiences that drive both business results and social impact, especially at the intersection of real estate and community equity.<\/p>","bios_artwork":"joyful-doodles-1-juliana-alonso","bios_quote":"<p>\"As a native New Yorker, I grew up surrounded by art in every form: from world-renowned institutions to the vibrant expressions on city walls and sidewalks. That early exposure instilled in me a deep belief in the power of art to inspire, connect, and uplift. My long-time involvement with New York Cares, including hands-on service painting parks and schools, has reinforced my commitment to making our shared environments more equitable and enriching for all. <\/p><p>Personally, I live with two invisible disabilities. While not severely limiting, they’ve given me a lasting appreciation for the courage it takes to pursue your passion when your mind or body doesn’t always cooperate.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_PhilKirschner.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/philkirschner\/"}},"select_yHRiNL":{"type":"select","settings":{"bios_name":"Rebekah Sigfrids","bios_pronouns":"","bios_title":"Head of Financial Center Design","bios_location":"","bios_company":"Bank of America","bios_company_link":"https:\/\/www.bankofamerica.com\/","bios_details":"<p>Rebekah Sigfrids is a creative leader who specializes in the design of new retail concepts. She began her career on the agency side, designing stores for brands including Timberland, Lens Crafters, and Lisa Frank. Transitioning in-house, she first joined L Brands where she led the design of new shop concepts for Victoria's Secret Sport and Beauty brands, Bath and Body Works, and La Senza. Rebekah held a similar role at Sephora, leading the design team responsible for new retail formats, fixtures, and roll-out. She is currently at Bank of America where she built an in-house team that is responsible for new concepts, flagships, and design roll-out of client facing Financial Centers. Passionate about education and having taught Interior Design early in her career, Rebekah is on the board of PAVE where she helps support the future of design through scholarships and mentorship for design students.<\/p>","bios_artwork":"floral-red-alicia-beach-print","bios_quote":"<p>\"ArtLifting is a much loved and valued partner. Artworks and murals are regularly placed in Bank of America Financial Centers where the works and the artists' stories are widely enjoyed by clients and associates.  ArtLifting's mission of supporting artists with disabilities aligns with our desire to create meaningful spaces for building relationships with clients.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_RebekahSigfrids.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/rebekah-sigfrids-053b155\/"}},"select_tzemJb":{"type":"select","settings":{"bios_name":"Sam Chandan","bios_pronouns":"","bios_title":"Founding Director, NYU Stern Chao-Hon Chen Institute for Global Real Estate Finance & Clinical Professor, Department of Finance","bios_location":"","bios_company":"NYU Stern School of Business","bios_company_link":"https:\/\/www.stern.nyu.edu\/","bios_details":"<p>Dr. Sam Chandan is the Founding Director of the Chen Institute at NYU Stern, where he leads research, policy, and academic programs in real estate. An economist and epidemiologist, he is a Fellow of several distinguished institutions and has held faculty appointments at Wharton, Dartmouth, and NYU. He previously served as Academic Dean at NYU Schack and Chief Economist at Real Capital Analytics and Reis. Dr. Chandan is a trusted advisor to global organizations, founder of Chandan Economics, and a leading voice in real estate media. He holds a PhD from Wharton and graduate degrees from Yale and Penn.<\/p>","bios_artwork":"let-s-discuss-laural-hartman","bios_quote":"<p>\"I support ArtLifting’s mission because safe, stable housing is the foundation from which creativity can truly flourish. Everyone deserves the opportunity to express themselves and be seen – and ArtLifting helps artists not only share their work, but build lives rooted in dignity, visibility, and possibility.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_SamChanden.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/samchandan\/"}},"select_kzjhty":{"type":"select","settings":{"bios_name":"Sandy Lish","bios_pronouns":"","bios_title":"Principal & Co-Founder","bios_location":"","bios_company":"The Castle Group","bios_company_link":"https:\/\/www.thecastlegrp.com\/","bios_details":"<p>Sandy Lish is an award-winning communications strategist and the co-founder of The Castle Group. With decades of experience, she has helped organizations grow, navigate complex challenges, and elevate their reputations through strategic public relations and crisis communications. Sandy leads with a focus on building strong partnerships, driving business development, and delivering meaningful results for clients across industries. She is deeply involved in the community, serves on multiple boards, and is a frequent speaker and thought leader. A proud UMass Amherst alumna, Sandy is passionate about the power of communication to create connection, influence change, and drive lasting impact.<\/p>","bios_artwork":"wheee-miyakah","bios_quote":"<p>\"I support ArtLifting’s mission because it aligns deeply with my belief in the power of storytelling, visibility, and dignity. ArtLifting creates meaningful opportunities for artists who are often overlooked – empowering them to share their work, earn income, and be seen for their talent rather than their circumstances. It’s more than art; it’s impact. As someone who has built a career around helping people and organizations be heard and understood, supporting ArtLifting is a natural extension of that purpose. It’s a privilege to champion a mission that transforms both individual lives and the way our communities value inclusion and creativity.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_Sandy_Lish.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/sandylish\/"}},"select_mzGrWj":{"type":"select","settings":{"bios_name":"Sean Devlin","bios_pronouns":"","bios_title":"VP, Global Employee Experience","bios_location":"","bios_company":"Duolingo","bios_company_link":"https:\/\/www.duolingo.com\/","bios_details":"<p>Sean Devlin is a seasoned workplace experience professional for almost 30 years in the technology and entertainment industries, including work with Fortune 100 companies such as Disney, Google, and Netflix. He excels in operational planning, neuroinclusive office designs, and leading high-performing, multi-site teams. Sean is known for his service-oriented mindset, creative problem-solving, and ability to build strong executive partnerships across the spectrum of employee experience. Recently, he has broadened his impact to include working on Social Impact and Community engagement efforts on behalf of Duolingo in addition to leading global workplace experience.<\/p>","bios_artwork":"urban-vertices-number-8-kari-souders","bios_quote":"<p>\"ArtLifting beautifully merges its support of underrepresented artists in need with the infusion of creativity into the workplace through this artistry. The company fosters a dual sense of community – connecting employees with meaningful art and uplifting artists through visibility and opportunity. This alignment of mission enhances a sense of belonging, empathy, and shared purpose across both the office environment and the broader artistic community.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_SeanDevlin.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/sedevlin\/"}},"select_R3ByE9":{"type":"select","settings":{"bios_name":"Stephen Brown","bios_pronouns":"","bios_title":"SVP, Global Market Development","bios_location":"","bios_company":"International WELL Building Institute","bios_company_link":"https:\/\/www.wellcertified.com\/","bios_details":"<p>Stephen brings over 25 years of global experience in interior solutions and workplace strategy across commercial markets. As Senior Vice President of Global Market Development at the International WELL Building Institute (IWBI), Stephen works closely with senior stakeholders who recognize that human health and well-being significantly influence key corporate performance metrics – including productivity, engagement, and resilience.<\/p><p>Stephen plays a pivotal role in guiding organizations on how to begin and scale their WELL journey, aligning WELL strategies with broader ESG goals, including GRESB, the UN Sustainable Development Goals (SDGs), and social sustainability reporting.<\/p><p>Before joining IWBI’s New York City headquarters in 2016, Stephen was based in Hong Kong as a Senior Global Account Manager, overseeing markets in Asia-Pacific, the Middle East, and Africa, with a focus on clients in the financial services sector.<\/p><p>Outside of work, Stephen enjoys hiking with his family, traveling internationally, and watching his daughter perform on stage. Passionate about personal wellness, he actively integrates healthy practices into daily life and connects with like-minded professionals through LinkedIn.<\/p>","bios_artwork":"acapella-acoustics","bios_quote":"<p>\"I support ArtLifting’s mission because it creates meaningful opportunity where it’s needed most – empowering artists with disabilities to share their talent with the world. Art has a unique ability to connect, inspire, and transform, and ArtLifting ensures that this power is accessible and inclusive.<\/p><p>By bridging the gap between underrepresented artists and socially conscious buyers, ArtLifting does more than sell artwork – it fosters dignity, visibility, and economic independence. It’s a shared mission I deeply believe in, and I’m proud to help expand its reach by connecting ArtLifting with our existing and prospective IWBI client network.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_StephenBrown.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/stephenpbrownglobalsalesleader\/"}},"select_JQh73A":{"type":"select","settings":{"bios_name":"Stuart Bern","bios_pronouns":"","bios_title":"Managing Director, Americas","bios_location":"","bios_company":"JLL","bios_company_link":"https:\/\/www.jll.com\/en-us\/","bios_details":"<p>As Managing Director of the Americas for JLL's Global Real Estate Technology Advisory Services consulting practice, Stuart is responsible for the growth, strategy, and support of our Fortune 500 customers and CRE occupiers and investors. Stuart serves as the primary contact for JLL's key executive stakeholders. Stuart has held global executive and leadership positions at both private, Fortune 500, and NASDAQ 100 companies, and helped scale early-stage SaaS startups through to successful exits. Stuart serves on various nonprofit Boards and as an Advisor to numerous Founders and CEOs. He is a frequent industry speaker, and in 2023, Stuart was named 40 Under 40.<\/p>","bios_artwork":"bristlecone-trunk-study-1-denali-brooke","bios_quote":"<p>\"As an artist, real estate professional, and someone who has witnessed firsthand the impact disabilities can have on individuals and their communities, ArtLifting’s mission deeply resonates with me. It aligns with my values and presents a meaningful opportunity to give back and lift up others.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_StuartBern.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/stuartbern\/"}},"select_6MnrCq":{"type":"select","settings":{"bios_name":"Suzanne Heidelberger","bios_pronouns":"","bios_title":"Managing Partner","bios_location":"","bios_company":"Reel Edge","bios_company_link":"https:\/\/www.reeledge.com\/","bios_details":"<p>Suzanne Heidelberger is a strategic partner to leaders and their teams, cultivating environments and results that maximize impact. With over three decades of global leadership experience at Fortune 500 companies, Suzanne adeptly merges data-driven analysis with innovative leadership and team development to create unique solutions for business problems. Her company, Suzanne Heidelberger Advisory, partners with clients to identify and develop bespoke solutions for real estate investment, workplace experience, org design and strategy.<br\/><br\/>Most recently, Suzanne was the President of Fidelity Real Estate Company, the corporate real estate division of Fidelity Investments. In her role, she oversaw the management of complex projects to create successful outcomes for Fidelity, covering a global real estate portfolio of more than 10M square feet, including office and call center space in 50+ locations, over 200 retail branches, data centers, solar arrays, and a 428-room hotel in Boston. She had responsibility for real estate strategy, business partnerships, workplace services, hospitality, facility management, real estate transactions, construction management, real estate technology, and engineering functions, overseeing the physical and virtual spaces and experiences that encourages Fidelity employees, businesses, and customers to thrive.<br\/> <br\/>Prior to joining Fidelity, Suzanne led the Global Real Estate and Workplace Experience division for American Express with responsibility for the workplace experience and real estate. She was also a Managing Director and Global Lead of Real Estate and Transaction Management at Deutsche Bank, based in New York and London. <br\/> <br\/>Earlier in her career, Suzanne led real estate for one of the world’s largest law firms: Skadden, Arps, Slate, Meagher & Flom, and previously was Vice President of Finance, Strategy and Transactions at J.P. Morgan. Suzanne developed her skills as an analyst and consultant at both Apollo Real Estate Advisors and Ernst & Young and holds a Bachelor of Science degree from Cornell University’s School of Hotel Administration.<br\/> <br\/>Committed to the development of real estate professionals, Suzanne lectured at Cornell, MIT, and NYU, has served on the Global Board of Directors of CoreNet, chaired its New York City Chapter, and served on the organization’s Learning and Women’s Committees. In addition, she served on the Board of Directors of the Regional Plan Association, is a Fellow and Assessor of the Royal Institute of Chartered Surveyors, participates on the U.S. Department of State's Bureau of Overseas Buildings Industry Advisory Group, and is a member of the Cornell Real Estate Council and Cornell Hotel Society.<br\/> <br\/>Suzanne lives in New York City and enjoys traveling, meeting new people, and solving puzzles.<\/p>","bios_artwork":"untitled-12-scott-benner","bios_quote":"<p>\"I have seen first hand how ArtLifting works with artists and customers and it is inspiring and impressive.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_SuzanneHeidelberger.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/suzanneheidelberger\/"}},"select_Fq4Qdt":{"type":"select","settings":{"bios_name":"Tiffany Yu","bios_pronouns":"","bios_title":"Author of The Anti-Ableist Manifesto, CEO & Founder","bios_location":"","bios_company":"Diversability","bios_company_link":"https:\/\/mydiversability.com\/","bios_details":"<p>Tiffany Yu is the CEO & Founder of Diversability, a 3x TEDx speaker, and the author of <em>The Anti-Ableist Manifesto: Smashing Stereotypes, Forging Change, and Building a Disability-Inclusive World<\/em>. She started her career at Goldman Sachs before becoming a speaker and writer on disability. At the age of 9, Tiffany became disabled as a result of a car accident that also took the life of her father.<\/p>","bios_artwork":"san-francisco-golden-gate-bridge-philip-ma","bios_quote":"<p>\"Art is a powerful form of expression and a vehicle for both economic empowerment and social change. ArtLifting’s mission resonates with me because it creates opportunities and visibility for artists who are too often left out, while also challenging societal narratives and celebrating talent, equity, and human dignity.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_TiffanyYu.jpg","bios_email":"","bios_linkedin":"http:\/\/linkedin.com\/in\/tiffanyayu"}},"select_KjWhGG":{"type":"select","settings":{"bios_name":"Vincent Uribe","bios_pronouns":"","bios_title":"Gallery Director","bios_location":"","bios_company":"Arts of Life, LVL3 & Epiphany Center for the Arts","bios_company_link":"https:\/\/artsoflife.org\/","bios_details":"<p>Vincent Uribe is a Chicago-based artist, curator, and creative community builder. He is the founding director of LVL3, an artist-run exhibition space and online publication launched in 2010, dedicated to supporting emerging and mid-career artists through collaborative programming. Since 2013, Uribe has served as Director of Exhibitions and Creative Partnerships at Arts of Life, a nonprofit supporting artists with intellectual and developmental disabilities, where he launched the Circle Contemporary galleries to integrate studio artists into the broader contemporary art scene. Additionally, he is the Art Director at Epiphany Center for the Arts, curating exhibitions that foster community engagement. Uribe serves on the executive board of the Intuit Museum of Art as well as Equity Arts, advocating for inclusivity in the arts.<\/p>","bios_artwork":"blue-beauty","bios_quote":"<p>\"Having been engaged with ArtLifting since the launch its been remarkable to see the growth of the company and the meaningful relationships they have been able to develop in support of artists.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_VincentUribe.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/vincent-uribe\/"}},"select_aCFyrW":{"type":"select","settings":{"bios_name":"Whitney Burns","bios_pronouns":"","bios_title":"Senior Managing Director, Global Head of Client Partnerships","bios_location":"","bios_company":"Hines","bios_company_link":"https:\/\/www.hines.com\/","bios_details":"<p>As the Senior Managing Director, Global Head of Client Partnerships, Whitney is focused on global strategy, innovation, and coordination in order to better solve clients' space and service needs. She is responsible for developing the firm’s vision and strategic roadmap to foster a culture of hospitality firmwide and elevate the client experience across product types, including Hines Workplace Services, the firm’s in-house flexible office and amenity platform designed to maximize efficiencies for clients and add value to assets.<br\/><br\/>Whitney joined Hines in 2013 as Director of Marketing for CityCenterDC in Washington, D.C., where she successfully brought the 10-acre, mixed-use development online from development to operations, overseeing all marketing, public relations, and public space programming initiatives. She then served as Director of Global Project Marketing and Digital Strategy at the firm’s headquarters in Houston, where she created and consulted on award-winning marketing, PR and placemaking strategies for more than 19-million square feet globally. Whitney joined Hines’ Southwest Region in 2019 as a project manager and regional business generator on the development and management side of the business. She was an instrumental player in the region’s push into the creative office and life science sectors.<br\/><br\/>Her out-of-the-box, innovative concepts and digital strategies have garnered numerous awards, including an Emmy in 2018 for her work at CityCenterDC. She has been named an Emerging Leader in Retail by Real Estate Forums and as a Woman to Watch by the Houston Business Journal. Whitney was a founding member of the OneHines Women’s Network and is an active member of CoreNet Global and ULI. Prior to her career at Hines, she spent time in marketing and production with Discovery Networks in Los Angeles and NBC News at Rockefeller Center in New York.<br\/><br\/>Whitney holds a Bachelor of Arts in Communications from the University of Southern California.<\/p>","bios_artwork":"ephemera-elizabeth-shanahan","bios_quote":"","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_WhitneyBurns.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/whitneybburns\/"}},"select_LRkDzP":{"type":"select","settings":{"bios_name":"Yanni Tsipis","bios_pronouns":"","bios_title":"Senior Vice President, Development","bios_location":"","bios_company":"WS Development","bios_company_link":"https:\/\/www.wsdevelopment.com\/","bios_details":"<p>Yanni Tsipis is Senior Vice President - Development at WS Development in Boston and oversees all aspects of the company’s Boston Seaport project, a 33-acre, 20-block, 7.6M square foot mixed-use development at the heart of the thriving innovation ecosystem in Boston’s Seaport District, as well as the 2.1M square-foot Fenway Corners project surrounding historic Fenway Park. A longtime historian of his native Boston and thought leader in the real estate industry, Yanni has written four books about the history of the city’s transportation infrastructure. He has served on numerous nonprofit boards and is a past member of the Boston Landmarks Commission. Yanni holds Bachelor’s and Master’s degrees from MIT and has been a faculty member at the MIT Center for Real Estate for over 20 years.<\/p>","bios_artwork":"the-triangle-of-one","bios_quote":"<p>\"We support ArtLifting's mission because the organization gives a voice to historically underrepresented artists, changes lives, and helps our places come alive with soul and meaning.\"<\/p>","bios_image":"shopify:\/\/shop_images\/AdvisoryBoardHeadshot_YanniTsipis.jpg","bios_email":"","bios_linkedin":"https:\/\/www.linkedin.com\/in\/yanni-tsipis-365b54a\/"}}},"block_order":["select_nFypAW","select_bT4qFK","select_fNiET7","select_8ViJXT","select_CGejUR","select_7WnH8U","select_nRqDbN","select_VqUwFx","select_YYg6xw","select_8tRGHi","select_MLHAPT","select_XXt8GJ","select_eNTEFg","select_mnhYXL","select_BRhY6B","select_3UgEHR","select_FUyJ9t","select_kMVgeH","select_4MYLct","select_9QBbmm","select_edDHiY","select_QiNmR4","select_VpNiEp","select_ex4BLR","select_xmxcY8","select_3WG7mE","select_mBjNw8","select_UWPy6N","select_WtprMB","select_iJqfa7","select_CnYDAy","select_kkrK7y","select_yHRiNL","select_tzemJb","select_kzjhty","select_mzGrWj","select_R3ByE9","select_JQh73A","select_6MnrCq","select_Fq4Qdt","select_KjWhGG","select_aCFyrW","select_LRkDzP"],"name":"Bios","settings":{}}},"order":["main","section_richtext_4Wm6eT","section_bios_Ma6Fyz"]}